RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_tim_ex.c
  /* Set the Lock level, the Break enable Bit and the Polarity, the OSSR State,
     the OSSI State, the dead time value and the Automatic Output Enable Bit */

  /* Set the BDTR bits */
  MODIFY_REG(tmpbdtr, TIM_BDTR_DTG, sBreakDeadTimeConfig->DeadTime);
  MODIFY_REG(tmpbdtr, TIM_BDTR_LOCK, sBreakDeadTimeConfig->LockLevel);
  MODIFY_REG(tmpbdtr, TIM_BDTR_OSSI, sBreakDeadTimeConfig->OffStateIDLEMode);
  MODIFY_REG(tmpbdtr, TIM_BDTR_OSSR, sBreakDeadTimeConfig->OffStateRunMode);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKE, sBreakDeadTimeConfig->BreakState);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKP, sBreakDeadTimeConfig->BreakPolarity);
  MODIFY_REG(tmpbdtr, TIM_BDTR_AOE, sBreakDeadTimeConfig->AutomaticOutput);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKF, (sBreakDeadTimeConfig->BreakFilter << TIM_BDTR_BKF_Pos));

  if (IS_TIM_ADVANCED_INSTANCE(htim->Instance))
  {
    /* Check the parameters */
    assert_param(IS_TIM_BREAK_AFMODE(sBreakDeadTimeConfig->BreakAFMode));

    /* Set BREAK AF mode */
    MODIFY_REG(tmpbdtr, TIM_BDTR_BKBID, sBreakDeadTimeConfig->BreakAFMode);
  }

  if (IS_TIM_BKIN2_INSTANCE(htim->Instance))
  {
    /* Check the parameters */
    assert_param(IS_TIM_BREAK2_STATE(sBreakDeadTimeConfig->Break2State));
    assert_param(IS_TIM_BREAK2_POLARITY(sBreakDeadTimeConfig->Break2Polarity));
    assert_param(IS_TIM_BREAK_FILTER(sBreakDeadTimeConfig->Break2Filter));

    /* Set the BREAK2 input related BDTR bits */
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2F, (sBreakDeadTimeConfig->Break2Filter << TIM_BDTR_BK2F_Pos));
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2E, sBreakDeadTimeConfig->Break2State);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2P, sBreakDeadTimeConfig->Break2Polarity);

    if (IS_TIM_ADVANCED_INSTANCE(htim->Instance))
    {
      /* Check the parameters */
      assert_param(IS_TIM_BREAK2_AFMODE(sBreakDeadTimeConfig->Break2AFMode));

      /* Set BREAK2 AF mode */
      MODIFY_REG(tmpbdtr, TIM_BDTR_BK2BID, sBreakDeadTimeConfig->Break2AFMode);
    }
  }

  /* Set TIMx_BDTR */
  htim->Instance->BDTR = tmpbdtr;

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Configures the break input source.
  * @param  htim TIM handle.
  * @param  BreakInput Break input to configure
  *          This parameter can be one of the following values:
  *            @arg TIM_BREAKINPUT_BRK: Timer break input
  *            @arg TIM_BREAKINPUT_BRK2: Timer break 2 input
  * @param  sBreakInputConfig Break input source configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_ConfigBreakInput(TIM_HandleTypeDef *htim,
                                             uint32_t BreakInput,
                                             const TIMEx_BreakInputConfigTypeDef *sBreakInputConfig)

{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tmporx;
  uint32_t bkin_enable_mask;
  uint32_t bkin_polarity_mask;
  uint32_t bkin_enable_bitpos;
  uint32_t bkin_polarity_bitpos;

  /* Check the parameters */
  assert_param(IS_TIM_BREAK_INSTANCE(htim->Instance));
  assert_param(IS_TIM_BREAKINPUT(BreakInput));
  assert_param(IS_TIM_BREAKINPUTSOURCE(sBreakInputConfig->Source));
  assert_param(IS_TIM_BREAKINPUTSOURCE_STATE(sBreakInputConfig->Enable));
  assert_param(IS_TIM_BREAKINPUTSOURCE_POLARITY(sBreakInputConfig->Polarity));

  /* Check input state */
  __HAL_LOCK(htim);

  switch (sBreakInputConfig->Source)
  {
    case TIM_BREAKINPUTSOURCE_BKIN:
    {
      bkin_enable_mask = TIM1_AF1_BKINE;
      bkin_enable_bitpos = TIM1_AF1_BKINE_Pos;
      bkin_polarity_mask = TIM1_AF1_BKINP;
      bkin_polarity_bitpos = TIM1_AF1_BKINP_Pos;
      break;
    }
#if defined(COMP1)
    case TIM_BREAKINPUTSOURCE_COMP1:
    {
      bkin_enable_mask = TIM1_AF1_BKCMP1E;
      bkin_enable_bitpos = TIM1_AF1_BKCMP1E_Pos;
      bkin_polarity_mask = TIM1_AF1_BKCMP1P;
      bkin_polarity_bitpos = TIM1_AF1_BKCMP1P_Pos;
      break;
    }
#endif /* COMP1 */

    default:
    {
      bkin_enable_mask = 0U;
      bkin_polarity_mask = 0U;
      bkin_enable_bitpos = 0U;
      bkin_polarity_bitpos = 0U;
      break;
    }
  }

  switch (BreakInput)
  {
    case TIM_BREAKINPUT_BRK:
    {
      /* Get the TIMx_AF1 register value */
      tmporx = htim->Instance->AF1;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF1 */
      htim->Instance->AF1 = tmporx;
      break;
    }
    case TIM_BREAKINPUT_BRK2:
    {
      /* Get the TIMx_AF2 register value */
      tmporx = htim->Instance->AF2;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF2 */
      htim->Instance->AF2 = tmporx;
      break;
    }
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

  return status;
}

/**
  * @brief  Configures the TIMx Remapping input capabilities.
  * @param  htim TIM handle.
  * @param  Remap specifies the TIM remapping source.
  *         For TIM1, the parameter can take one of the following values:
  *            @arg TIM_TIM1_ETR_GPIO           TIM1 ETR is connected to GPIO
  *            @arg TIM_TIM1_ETR_COMP1          TIM1 ETR is connected to COMP1 output  (*)
  *            @arg TIM_TIM1_ETR_ADC1_AWD1      TIM1 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM1_ETR_ADC1_AWD2      TIM1 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM1_ETR_ADC1_AWD3      TIM1 ETR is connected to ADC1 AWD3
  *
  *         For TIM2, the parameter can take one of the following values:
  *            @arg TIM_TIM2_ETR_GPIO            TIM2 ETR is connected to GPIO
  *            @arg TIM_TIM2_ETR_COMP1           TIM2 ETR is connected to COMP1 output  (*)
  *            @arg TIM_TIM2_ETR_LSE             TIM2 ETR is connected to LSE
  *            @arg TIM_TIM2_ETR_SAI1_FSA        TIM2 ETR is connected to SAI1 FSA      (*)
  *            @arg TIM_TIM2_ETR_SAI1_FSB        TIM2 ETR is connected to SAI1 FSB      (*)
  *            @arg TIM_TIM2_ETR_TIM3_ETR        TIM2 ETR is connected to TIM3 ETR pin
  *            @arg TIM_TIM2_ETR_TIM4_ETR        TIM2 ETR is connected to TIM4 ETR pin  (*)
  *            @arg TIM_TIM2_ETR_TIM5_ETR        TIM2 ETR is connected to TIM5 ETR pin  (*)
  *            @arg TIM_TIM2_ETR_ETH_PPS         TIM2 ETR is connected to ETH PPS       (*)
  *
  *         For TIM3, the parameter can take one of the following values:
  *            @arg TIM_TIM3_ETR_GPIO            TIM3 ETR is connected to GPIO
  *            @arg TIM_TIM3_ETR_COMP1           TIM3 ETR is connected to COMP1 output  (*)
  *            @arg TIM_TIM3_ETR_TIM2_ETR        TIM3 ETR is connected to TIM2 ETR pin
  *            @arg TIM_TIM3_ETR_TIM4_ETR        TIM3 ETR is connected to TIM4 ETR pin  (*)
  *            @arg TIM_TIM3_ETR_TIM5_ETR        TIM3 ETR is connected to TIM5 ETR pin  (*)
  *            @arg TIM_TIM3_ETR_ETH_PPS         TIM3 ETR is connected to ETH PPS       (*)
  *
  *         For TIM4, the parameter can take one of the following values: (**)
  *            @arg TIM_TIM4_ETR_GPIO              TIM4 ETR is connected to GPIO
  *            @arg TIM_TIM4_ETR_TIM2_ETR          TIM4 ETR is connected to TIM2 ETR pin
  *            @arg TIM_TIM4_ETR_TIM3_ETR          TIM4 ETR is connected to TIM3 ETR pin
  *            @arg TIM_TIM4_ETR_TIM5_ETR          TIM4 ETR is connected to TIM5 ETR pin
  *
  *         For TIM5, the parameter can take one of the following values: (**)
  *            @arg TIM_TIM5_ETR_GPIO              TIM5 ETR is connected to GPIO
  *            @arg TIM_TIM2_ETR_SAI2_FSA        TIM2 ETR is connected to SAI2 FSA
  *            @arg TIM_TIM2_ETR_SAI2_FSB        TIM2 ETR is connected to SAI2 FSB
  *            @arg TIM_TIM5_ETR_TIM2_ETR          TIM5 ETR is connected to TIM2 ETR pin
  *            @arg TIM_TIM5_ETR_TIM3_ETR          TIM5 ETR is connected to TIM3 ETR pin
  *            @arg TIM_TIM5_ETR_TIM4_ETR          TIM5 ETR is connected to TIM4 ETR pin
  *
  *         For TIM8, the parameter can take one of the following values: (**)
  *            @arg TIM_TIM8_ETR_GPIO            TIM8 ETR is connected to GPIO
  *            @arg TIM_TIM8_ETR_ADC2_AWD1       TIM8 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM8_ETR_ADC2_AWD2       TIM8 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM8_ETR_ADC2_AWD3       TIM8 ETR is connected to ADC2 AWD3
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices. \n
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_RemapConfig(TIM_HandleTypeDef *htim, uint32_t Remap)
{
  /* Check parameters */
  assert_param(IS_TIM_REMAP_INSTANCE(htim->Instance));
  assert_param(IS_TIM_REMAP(Remap));

  __HAL_LOCK(htim);

  MODIFY_REG(htim->Instance->AF1, TIM1_AF1_ETRSEL_Msk, Remap);

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Select the timer input source
  * @param  htim TIM handle.
  * @param  Channel specifies the TIM Channel
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TI1 input channel
  *            @arg TIM_CHANNEL_2: TI2 input channel
  *            @arg TIM_CHANNEL_4: TI4 input channel
  * @param  TISelection parameter of the TIM_TISelectionStruct structure is detailed as follows:
  *         For TIM1, the parameter is one of the following values:
  *            @arg TIM_TIM1_TI1_GPIO:                TIM1 TI1 is connected to GPIO
  *            @arg TIM_TIM1_TI1_COMP1:               TIM1 TI1 is connected to COMP1 output (*)
  *            @arg TIM_TIM1_TI2_GPIO:                TIM1 TI2 is connected to GPIO
  *            @arg TIM_TIM1_TI3_GPIO:                TIM1 TI3 is connected to GPIO
  *            @arg TIM_TIM1_TI4_GPIO:                TIM1 TI4 is connected to GPIO
  *
  *         For TIM2, the parameter is one of the following values:
  *            @arg TIM_TIM2_TI1_GPIO:                TIM2 TI1 is connected to GPIO
  *            @arg TIM_TIM2_TI1_LSI:                 TIM2 TI1 is connected to LSI          (*)
  *            @arg TIM_TIM2_TI1_LSE:                 TIM2 TI1 is connected to LSE          (*)
  *            @arg TIM_TIM2_TI1_ETH_PPS              TIM2 TI1 is connected to ETH PPS      (*)
  *            @arg TIM_TIM2_TI1_RTC_WKUP:            TIM2 TI2 is connected to RTC_WKUP     (*)
  *            @arg TIM_TIM2_TI1_TIM3_TI1:            TIM2 TI2 is connected to TIM3_TI1     (*)
  *            @arg TIM_TIM2_TI2_GPIO:                TIM2 TI2 is connected to GPIO
  *            @arg TIM_TIM2_TI2_HSI_1024:            TIM2 TI2 is connected to HSI/1024     (*)
  *            @arg TIM_TIM2_TI2_CSI_128:             TIM2 TI2 is connected to CSI/128      (*)
  *            @arg TIM_TIM2_TI2_MCO2:                TIM2 TI2 is connected to MCO1         (*)
  *            @arg TIM_TIM2_TI2_MCO1:                TIM2 TI2 is connected to MCO1         (*)
  *            @arg TIM_TIM2_TI3_GPIO:                TIM2 TI3 is connected to GPIO
  *            @arg TIM_TIM2_TI4_GPIO:                TIM2 TI4 is connected to GPIO
  *            @arg TIM_TIM2_TI4_COMP1:               TIM2 TI4 is connected to COMP1 output (*)
  *
  *         For TIM3, the parameter is one of the following values:
  *            @arg TIM_TIM3_TI1_GPIO:                TIM3 TI1 is connected to GPIO
  *            @arg TIM_TIM3_TI1_COMP1:               TIM3 TI1 is connected to COMP1 output (*)
  *            @arg TIM_TIM3_TI1_MCO1:                TIM3 TI2 is connected to MCO1         (*)
  *            @arg TIM_TIM3_TI1_TIM2_TI1:            TIM3 TI2 is connected to TIM2 TI1     (*)
  *            @arg TIM_TIM3_TI1_HSE_1MHZ:            TIM3 TI2 is connected to HSE_1MHZ     (*)
  *            @arg TIM_TIM3_TI1_ETH_PPS              TIM3 TI1 is connected to ETH PPS      (*)
  *            @arg TIM_TIM3_TI2_GPIO:                TIM3 TI2 is connected to GPIO
  *            @arg TIM_TIM3_TI2_CSI_128:             TIM3 TI2 is connected to CSI_128      (*)
  *            @arg TIM_TIM3_TI2_MCO2:                TIM3 TI2 is connected to MCO2         (*)
  *            @arg TIM_TIM3_TI2_HSI_1024:            TIM3 TI2 is connected to HSI_1024     (*)
  *            @arg TIM_TIM3_TI3_GPIO:                TIM3 TI2 is connected to GPIO
  *            @arg TIM_TIM3_TI4_GPIO:                TIM3 TI2 is connected to GPIO
  *
  *         For TIM4, the parameter is one of the following values: (**)
  *            @arg TIM_TIM4_TI1_GPIO:                TIM4 TI1 is connected to GPIO
  *            @arg TIM_TIM4_TI2_GPIO:                TIM4 TI2 is connected to GPIO
  *            @arg TIM_TIM4_TI3_GPIO:                TIM4 TI3 is connected to GPIO
  *            @arg TIM_TIM4_TI4_GPIO:                TIM4 TI4 is connected to GPIO
  *
  *         For TIM5, the parameter is one of the following values: (**)
  *            @arg TIM_TIM5_TI1_GPIO:                TIM5 TI1 is connected to GPIO
  *            @arg TIM_TIM5_TI2_GPIO:                TIM5 TI2 is connected to GPIO
  *            @arg TIM_TIM5_TI3_GPIO:                TIM5 TI3 is connected to GPIO
  *            @arg TIM_TIM5_TI4_GPIO:                TIM5 TI4 is connected to GPIO
  *
  *         For TIM8, the parameter is one of the following values: (**)
  *            @arg TIM_TIM8_TI1_GPIO:                TIM8 TI1 is connected to GPIO
  *            @arg TIM_TIM8_TI2_GPIO:                TIM8 TI2 is connected to GPIO
  *            @arg TIM_TIM8_TI3_GPIO:                TIM8 TI3 is connected to GPIO
  *            @arg TIM_TIM8_TI4_GPIO:                TIM8 TI4 is connected to GPIO
  *
  *         For TIM12, the parameter is one of the following values: (**)
  *            @arg TIM_TIM12_TI1_GPIO:              TIM12 TI1 is connected to GPIO
  *            @arg TIM_TIM12_TI1_HSI_1024:          TIM12 TI1 is connected to HSI/1024
  *            @arg TIM_TIM12_TI1_CSI_128:           TIM12 TI1 is connected to CSI/128
  *
  *         For TIM13, the parameter is one of the following values: (**)
  *            @arg TIM_TIM12_TI1_GPIO:              TIM13 TI1 is connected to GPIO
  *
  *         For TIM14, the parameter is one of the following values: (**)
  *            @arg TIM_TIM14_TI1_GPIO:              TIM14 TI1 is connected to GPIO
  *
  *         For TIM15, the parameter can have the following values: (**)
  *            @arg TIM_TIM15_TI1_GPIO:              TIM15 TI1 is connected to GPIO
  *            @arg TIM_TIM15_TI1_TIM2:              TIM15 TI1 is connected to TIM2
  *            @arg TIM_TIM15_TI1_TIM3:              TIM15 TI1 is connected to TIM3
  *            @arg TIM_TIM15_TI1_TIM4:              TIM15 TI1 is connected to TIM4
  *            @arg TIM_TIM15_TI1_LSE:               TIM15 TI1 is connected to LSE
  *            @arg TIM_TIM15_TI1_CSI_128:           TIM15 TI1 is connected to CSI/128
  *            @arg TIM_TIM15_TI1_MCO:               TIM15 TI1 is connected to MCO
  *            @arg TIM_TIM15_TI2_GPIO:              TIM15 TI1 is connected to GPIO
  *            @arg TIM_TIM15_TI2_TIM2:              TIM15 TI1 is connected to TIM2
  *            @arg TIM_TIM15_TI2_TIM3:              TIM15 TI1 is connected to TIM3
  *            @arg TIM_TIM15_TI2_TIM4:              TIM15 TI1 is connected to TIM4
  *
  *         For TIM16, the parameter is one of the following values: (**)
  *            @arg TIM_TIM16_TI1_GPIO:              TIM16 TI1 is connected to GPIO
  *            @arg TIM_TIM16_TI1_LSI:               TIM16 TI1 is connected to LSI
  *            @arg TIM_TIM16_TI1_LSE:               TIM16 TI1 is connected to LSE
  *            @arg TIM_TIM16_TI1_RTC_WKUP:          TIM16 TI1 is connected to RTCWKUP
  *
  *         For TIM17, the parameter can have the following values: (**)
  *            @arg TIM_TIM17_TI1_GPIO:              TIM17 TI1 is connected to GPIO
  *            @arg TIM_TIM17_TI1_HSE_1MHZ:          TIM17 TI1 is connected to HSE_1MHZ
  *            @arg TIM_TIM17_TI1_MCO:               TIM17 TI1 is connected to MCO
  *
  *         (*)  Value not defined in all devices. \n
  *         (**) Timer instance not available on all devices. \n
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_TIMEx_TISelection(TIM_HandleTypeDef *htim, uint32_t TISelection, uint32_t Channel)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_TIM_TISEL_INSTANCE(htim->Instance));
  assert_param(IS_TIM_TISEL(TISelection));

  __HAL_LOCK(htim);

  switch (Channel)
  {
    case TIM_CHANNEL_1:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI1SEL, TISelection);
      break;
    case TIM_CHANNEL_2:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI2SEL, TISelection);
      break;
    case TIM_CHANNEL_4:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI4SEL, TISelection);
      break;
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

